In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\admin\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: six in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: ipython in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: ipython-genutils in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (2.0.8)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\admin\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\admin\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: colorama in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: matplotlib-inline in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: pygments>=2.4.0 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (61.2.0)
Requirement already satisfied: backcall in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: traitlets>=5 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: stack-data in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\admin\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\admin\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)
Requirement already satisfied: executing in c:\users\admin\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\admin\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\admin\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///database.db

In [4]:
%%sql
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    department TEXT
);

 * sqlite:///database.db
(sqlite3.OperationalError) table employees already exists
[SQL: CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    department TEXT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [5]:
%%sql
INSERT INTO employees (id, name, department) VALUES
(1, 'John Doe', 'Sales'),
(2, 'Jane Smith', 'Marketing'),
(3, 'Bob Johnson', 'Finance');

 * sqlite:///database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: employees.id
[SQL: INSERT INTO employees (id, name, department) VALUES
(1, 'John Doe', 'Sales'),
(2, 'Jane Smith', 'Marketing'),
(3, 'Bob Johnson', 'Finance');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [6]:
%%sql
SELECT * FROM employees;

 * sqlite:///database.db
Done.

[(1, 'John Doe', 'Sales'),
 (2, 'Jane Smith', 'Marketing'),
 (3, 'Bob Johnson', 'Finance')]

In [7]:
%%sql 
CREATE TABLE students(
    rno INT PRIMARY KEY,
    sname TEXT,
    department TEXT
    );

 * sqlite:///database.db
(sqlite3.OperationalError) table students already exists
[SQL: CREATE TABLE students(
    rno INT PRIMARY KEY,
    sname TEXT,
    department TEXT
    );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
%%sql
INSERT INTO students(rno,sname,department) VALUES
(1,'Rahul Raut','Mechanical'),
(2,'Santosh Bhosale','Computer'),
(3,'Sunil Zambre','IT'),
(4,'Anil Kumbhar','Admin');

 * sqlite:///database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: students.rno
[SQL: INSERT INTO students(rno,sname,department) VALUES
(1,'Rahul Raut','Mechanical'),
(2,'Santosh Bhosale','Computer'),
(3,'Sunil Zambre','IT'),
(4,'Anil Kumbhar','Admin');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [9]:
%%sql
SELECT * FROM students;

 * sqlite:///database.db
Done.

[(1, 'Rahul Raut', 'Mechanical'),
 (2, 'Santosh Bhosale', 'Computer'),
 (3, 'Sunil Zambre', 'IT'),
 (4, 'Anil Kumbhar', 'Admin')]

In [10]:
%%sql
ALTER TABLE students
ADD COLUMN mobile_no INTEGER;

 * sqlite:///database.db
Done.

[]

In [11]:
%%sql
UPDATE students
SET mobile_no =6789909009;

 * sqlite:///database.db
4 rows affected.

[]

In [12]:
%%sql
SELECT * FROM students;

 * sqlite:///database.db
Done.

[(1, 'Rahul Raut', 'Mechanical', 6789909009),
 (2, 'Santosh Bhosale', 'Computer', 6789909009),
 (3, 'Sunil Zambre', 'IT', 6789909009),
 (4, 'Anil Kumbhar', 'Admin', 6789909009)]

In [13]:
%%sql
SELECT * FROM students LIMIT 2;

 * sqlite:///database.db
Done.

[(1, 'Rahul Raut', 'Mechanical', 6789909009),
 (2, 'Santosh Bhosale', 'Computer', 6789909009)]

In [16]:
%%sql
SELECT * FROM students ORDER BY rno DESC LIMIT 2;

 * sqlite:///database.db
Done.

[(4, 'Anil Kumbhar', 'Admin', 6789909009),
 (3, 'Sunil Zambre', 'IT', 6789909009)]

In [18]:
%%sql
#connecting and creating with the database.
db = sqlite3.connect("testing.db")
db.execute("drop table if exists results")

 * sqlite:///database.db
(sqlite3.OperationalError) near "#connecting": syntax error
[SQL: #connecting and creating with the database.
db = sqlite3.connect("testing.db")
db.execute("drop table if exists results")]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [19]:
#connecting to and creating the database
db = sqlite3.connect("testing.db")

#drop the table if it exists
db.execute("DROP TABLE IF EXISTS results")

#add your other SQL statements here, each in its own call to db.execute()

NameError: name 'sqlite3' is not defined

In [20]:
%%sql
testing.db

 * sqlite:///database.db
(sqlite3.OperationalError) near "testing": syntax error
[SQL: testing.db]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [21]:
%%sql
CREATE TABLE products (
  id INT PRIMARY KEY,
  name VARCHAR(255),
  price DECIMAL(10,2)
);

 * sqlite:///database.db
Done.

[]

In [22]:
%%sql
INSERT INTO products (id, name, price)
VALUES (1, 'Rice', 45),(2,'Sugar',34),(3,'Pulse',40);

 * sqlite:///database.db
3 rows affected.

[]

In [23]:
%%sql
SELECT * FROM products

 * sqlite:///database.db
Done.

[(1, 'Rice', 45), (2, 'Sugar', 34), (3, 'Pulse', 40)]

In [24]:
%%sql
UPDATE products
SET name = 'Sugar', price = 50
WHERE id = 2;

 * sqlite:///database.db
1 rows affected.

[]

In [25]:
%%sql
SELECT * FROM products

 * sqlite:///database.db
Done.

[(1, 'Rice', 45), (2, 'Sugar', 50), (3, 'Pulse', 40)]

In [26]:
%%sql

CREATE TABLE patient (
    patient_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    gender VARCHAR(10) NOT NULL,
    city VARCHAR(50) NOT NULL,
    height DECIMAL(5,2),
    allergies VARCHAR(100),
    doctor_name VARCHAR(100) NOT NULL,
    address VARCHAR(200) NOT NULL
);

 * sqlite:///database.db
Done.

[]

In [27]:
%%sql
INSERT INTO patient (patient_id, first_name, last_name, gender, city, height, allergies, doctor_name, address)
VALUES 
(1, 'John', 'Doe', 'Male', 'New York', 6.1, 'Pollen', 'Dr. Smith', '123 Main St.'),
(2, 'Jane', 'Doe', 'Female', 'Chicago', 5.5, 'Penicillin', 'Dr. Johnson', '456 Maple Ave.'),
(3, 'Mike', 'Smith', 'Male', 'Los Angeles', 6.2, 'Dust', 'Dr. Lee', '789 Oak St.'),
(4, 'Sarah', 'Lee', 'Female', 'San Francisco', 5.8, NULL, 'Dr. Davis', '1010 Elm St.'),
(5, 'Robert', 'Jones', 'Male', 'Houston', 6.0, 'Seafood', 'Dr. Brown', '1111 Walnut St.'),
(6, 'Mary', 'Wilson', 'Female', 'Philadelphia', 5.4, NULL, 'Dr. Taylor', '2222 Cedar St.'),
(7, 'David', 'Clark', 'Male', 'Phoenix', 6.3, 'Peanuts', 'Dr. Hernandez', '3333 Birch St.'),
(8, 'Lisa', 'Garcia', 'Female', 'Miami', 5.7, 'Latex', 'Dr. Patel', '4444 Pine St.'),
(9, 'Chris', 'Robinson', 'Male', 'Dallas', 6.1, NULL, 'Dr. Williams', '5555 Ash St.'),
(10, 'Amanda', 'Hall', 'Female', 'Atlanta', 5.6, 'Eggs', 'Dr. Garcia', '6666 Oak St.');

 * sqlite:///database.db
10 rows affected.

[]

In [28]:
%%sql 
SELECT * FROM patient;

 * sqlite:///database.db
Done.

[(1, 'John', 'Doe', 'Male', 'New York', 6.1, 'Pollen', 'Dr. Smith', '123 Main St.'),
 (2, 'Jane', 'Doe', 'Female', 'Chicago', 5.5, 'Penicillin', 'Dr. Johnson', '456 Maple Ave.'),
 (3, 'Mike', 'Smith', 'Male', 'Los Angeles', 6.2, 'Dust', 'Dr. Lee', '789 Oak St.'),
 (4, 'Sarah', 'Lee', 'Female', 'San Francisco', 5.8, None, 'Dr. Davis', '1010 Elm St.'),
 (5, 'Robert', 'Jones', 'Male', 'Houston', 6, 'Seafood', 'Dr. Brown', '1111 Walnut St.'),
 (6, 'Mary', 'Wilson', 'Female', 'Philadelphia', 5.4, None, 'Dr. Taylor', '2222 Cedar St.'),
 (7, 'David', 'Clark', 'Male', 'Phoenix', 6.3, 'Peanuts', 'Dr. Hernandez', '3333 Birch St.'),
 (8, 'Lisa', 'Garcia', 'Female', 'Miami', 5.7, 'Latex', 'Dr. Patel', '4444 Pine St.'),
 (9, 'Chris', 'Robinson', 'Male', 'Dallas', 6.1, None, 'Dr. Williams', '5555 Ash St.'),
 (10, 'Amanda', 'Hall', 'Female', 'Atlanta', 5.6, 'Eggs', 'Dr. Garcia', '6666 Oak St.')]

In [29]:
%%sql
INSERT INTO patient (patient_id, first_name, last_name, gender, city, height, allergies, doctor_name, address)
VALUES
(11, 'Kevin', 'Nguyen', 'Male', 'Seattle', 5.9, 'Pollen', 'Dr. Chen', '7777 Cedar St.'),
(12, 'Rachel', 'Kim', 'Female', 'Boston', 5.2, 'Peanuts', 'Dr. Kim', '8888 Pine St.'),
(13, 'Timothy', 'Gomez', 'Male', 'San Diego', 6.0, 'Dust', 'Dr. Lee', '9999 Oak St.'),
(14, 'Samantha', 'Chen', 'Female', 'Denver', 5.4, NULL, 'Dr. Lee', '1010 Spruce St.'),
(15, 'Joshua', 'Wong', 'Male', 'Las Vegas', 5.8, 'Seafood', 'Dr. Davis', '1212 Maple Ave.'),
(16, 'Emily', 'Wang', 'Female', 'Portland', 5.5, 'Latex', 'Dr. Hernandez', '1313 Elm St.'),
(17, 'Daniel', 'Lee', 'Male', 'Austin', 6.1, NULL, 'Dr. Kim', '1414 Oak St.'),
(18, 'Stephanie', 'Lin', 'Female', 'Charlotte', 5.7, 'Eggs', 'Dr. Davis', '1515 Walnut St.'),
(19, 'Matthew', 'Choi', 'Male', 'Seattle', 6.2, NULL, 'Dr. Hernandez', '1616 Pine St.'),
(20, 'Cynthia', 'Park', 'Female', 'Houston', 5.6, 'Latex', 'Dr. Patel', '1717 Cedar St.');

 * sqlite:///database.db
10 rows affected.

[]

In [30]:
%%sql
SELECT * FROM patient;

 * sqlite:///database.db
Done.

[(1, 'John', 'Doe', 'Male', 'New York', 6.1, 'Pollen', 'Dr. Smith', '123 Main St.'),
 (2, 'Jane', 'Doe', 'Female', 'Chicago', 5.5, 'Penicillin', 'Dr. Johnson', '456 Maple Ave.'),
 (3, 'Mike', 'Smith', 'Male', 'Los Angeles', 6.2, 'Dust', 'Dr. Lee', '789 Oak St.'),
 (4, 'Sarah', 'Lee', 'Female', 'San Francisco', 5.8, None, 'Dr. Davis', '1010 Elm St.'),
 (5, 'Robert', 'Jones', 'Male', 'Houston', 6, 'Seafood', 'Dr. Brown', '1111 Walnut St.'),
 (6, 'Mary', 'Wilson', 'Female', 'Philadelphia', 5.4, None, 'Dr. Taylor', '2222 Cedar St.'),
 (7, 'David', 'Clark', 'Male', 'Phoenix', 6.3, 'Peanuts', 'Dr. Hernandez', '3333 Birch St.'),
 (8, 'Lisa', 'Garcia', 'Female', 'Miami', 5.7, 'Latex', 'Dr. Patel', '4444 Pine St.'),
 (9, 'Chris', 'Robinson', 'Male', 'Dallas', 6.1, None, 'Dr. Williams', '5555 Ash St.'),
 (10, 'Amanda', 'Hall', 'Female', 'Atlanta', 5.6, 'Eggs', 'Dr. Garcia', '6666 Oak St.'),
 (11, 'Kevin', 'Nguyen', 'Male', 'Seattle', 5.9, 'Pollen', 'Dr. Chen', '7777 Cedar St.'),
 (12, 'Rachel', 'Kim', 'Female', 'Boston', 5.2, 'Peanuts', 'Dr. Kim', '8888 Pine St.'),
 (13, 'Timothy', 'Gomez', 'Male', 'San Diego', 6, 'Dust', 'Dr. Lee', '9999 Oak St.'),
 (14, 'Samantha', 'Chen', 'Female', 'Denver', 5.4, None, 'Dr. Lee', '1010 Spruce St.'),
 (15, 'Joshua', 'Wong', 'Male', 'Las Vegas', 5.8, 'Seafood', 'Dr. Davis', '1212 Maple Ave.'),
 (16, 'Emily', 'Wang', 'Female', 'Portland', 5.5, 'Latex', 'Dr. Hernandez', '1313 Elm St.'),
 (17, 'Daniel', 'Lee', 'Male', 'Austin', 6.1, None, 'Dr. Kim', '1414 Oak St.'),
 (18, 'Stephanie', 'Lin', 'Female', 'Charlotte', 5.7, 'Eggs', 'Dr. Davis', '1515 Walnut St.'),
 (19, 'Matthew', 'Choi', 'Male', 'Seattle', 6.2, None, 'Dr. Hernandez', '1616 Pine St.'),
 (20, 'Cynthia', 'Park', 'Female', 'Houston', 5.6, 'Latex', 'Dr. Patel', '1717 Cedar St.')]

In [31]:
%%sql
SELECT * FROM patient WHERE doctor_name = 'Dr. Smith'; #Retrieve the patient records with a specific doctor name

 * sqlite:///database.db
Done.

[(1, 'John', 'Doe', 'Male', 'New York', 6.1, 'Pollen', 'Dr. Smith', '123 Main St.')]

In [33]:
%%sql
SELECT * FROM patient ORDER BY last_name ASC; #Retrieve the patient records sorted by last name in ascending order

 * sqlite:///database.db
Done.

[(14, 'Samantha', 'Chen', 'Female', 'Denver', 5.4, None, 'Dr. Lee', '1010 Spruce St.'),
 (19, 'Matthew', 'Choi', 'Male', 'Seattle', 6.2, None, 'Dr. Hernandez', '1616 Pine St.'),
 (7, 'David', 'Clark', 'Male', 'Phoenix', 6.3, 'Peanuts', 'Dr. Hernandez', '3333 Birch St.'),
 (1, 'John', 'Doe', 'Male', 'New York', 6.1, 'Pollen', 'Dr. Smith', '123 Main St.'),
 (2, 'Jane', 'Doe', 'Female', 'Chicago', 5.5, 'Penicillin', 'Dr. Johnson', '456 Maple Ave.'),
 (8, 'Lisa', 'Garcia', 'Female', 'Miami', 5.7, 'Latex', 'Dr. Patel', '4444 Pine St.'),
 (13, 'Timothy', 'Gomez', 'Male', 'San Diego', 6, 'Dust', 'Dr. Lee', '9999 Oak St.'),
 (10, 'Amanda', 'Hall', 'Female', 'Atlanta', 5.6, 'Eggs', 'Dr. Garcia', '6666 Oak St.'),
 (5, 'Robert', 'Jones', 'Male', 'Houston', 6, 'Seafood', 'Dr. Brown', '1111 Walnut St.'),
 (12, 'Rachel', 'Kim', 'Female', 'Boston', 5.2, 'Peanuts', 'Dr. Kim', '8888 Pine St.'),
 (4, 'Sarah', 'Lee', 'Female', 'San Francisco', 5.8, None, 'Dr. Davis', '1010 Elm St.'),
 (17, 'Daniel', 'Lee', 'Male', 'Austin', 6.1, None, 'Dr. Kim', '1414 Oak St.'),
 (18, 'Stephanie', 'Lin', 'Female', 'Charlotte', 5.7, 'Eggs', 'Dr. Davis', '1515 Walnut St.'),
 (11, 'Kevin', 'Nguyen', 'Male', 'Seattle', 5.9, 'Pollen', 'Dr. Chen', '7777 Cedar St.'),
 (20, 'Cynthia', 'Park', 'Female', 'Houston', 5.6, 'Latex', 'Dr. Patel', '1717 Cedar St.'),
 (9, 'Chris', 'Robinson', 'Male', 'Dallas', 6.1, None, 'Dr. Williams', '5555 Ash St.'),
 (3, 'Mike', 'Smith', 'Male', 'Los Angeles', 6.2, 'Dust', 'Dr. Lee', '789 Oak St.'),
 (16, 'Emily', 'Wang', 'Female', 'Portland', 5.5, 'Latex', 'Dr. Hernandez', '1313 Elm St.'),
 (6, 'Mary', 'Wilson', 'Female', 'Philadelphia', 5.4, None, 'Dr. Taylor', '2222 Cedar St.'),
 (15, 'Joshua', 'Wong', 'Male', 'Las Vegas', 5.8, 'Seafood', 'Dr. Davis', '1212 Maple Ave.')]

In [34]:
%%sql
SELECT * FROM patient WHERE height BETWEEN 5.5 AND 6.0;

 * sqlite:///database.db
Done.

[(2, 'Jane', 'Doe', 'Female', 'Chicago', 5.5, 'Penicillin', 'Dr. Johnson', '456 Maple Ave.'),
 (4, 'Sarah', 'Lee', 'Female', 'San Francisco', 5.8, None, 'Dr. Davis', '1010 Elm St.'),
 (5, 'Robert', 'Jones', 'Male', 'Houston', 6, 'Seafood', 'Dr. Brown', '1111 Walnut St.'),
 (8, 'Lisa', 'Garcia', 'Female', 'Miami', 5.7, 'Latex', 'Dr. Patel', '4444 Pine St.'),
 (10, 'Amanda', 'Hall', 'Female', 'Atlanta', 5.6, 'Eggs', 'Dr. Garcia', '6666 Oak St.'),
 (11, 'Kevin', 'Nguyen', 'Male', 'Seattle', 5.9, 'Pollen', 'Dr. Chen', '7777 Cedar St.'),
 (13, 'Timothy', 'Gomez', 'Male', 'San Diego', 6, 'Dust', 'Dr. Lee', '9999 Oak St.'),
 (15, 'Joshua', 'Wong', 'Male', 'Las Vegas', 5.8, 'Seafood', 'Dr. Davis', '1212 Maple Ave.'),
 (16, 'Emily', 'Wang', 'Female', 'Portland', 5.5, 'Latex', 'Dr. Hernandez', '1313 Elm St.'),
 (18, 'Stephanie', 'Lin', 'Female', 'Charlotte', 5.7, 'Eggs', 'Dr. Davis', '1515 Walnut St.'),
 (20, 'Cynthia', 'Park', 'Female', 'Houston', 5.6, 'Latex', 'Dr. Patel', '1717 Cedar St.')]

In [35]:
%%sql
SELECT * FROM patient WHERE gender = 'Female' AND city = 'Chicago';

 * sqlite:///database.db
Done.

[(2, 'Jane', 'Doe', 'Female', 'Chicago', 5.5, 'Penicillin', 'Dr. Johnson', '456 Maple Ave.')]

In [36]:
%%sql
SELECT * FROM patient WHERE allergies = 'Pollen';

 * sqlite:///database.db
Done.

[(1, 'John', 'Doe', 'Male', 'New York', 6.1, 'Pollen', 'Dr. Smith', '123 Main St.'),
 (11, 'Kevin', 'Nguyen', 'Male', 'Seattle', 5.9, 'Pollen', 'Dr. Chen', '7777 Cedar St.')]

In [40]:
import teradatasql
import pandas as pd

# Define the connection parameters
host = 'host123'
user = 'sunil'
password = 'sunil@123'

# Establish a connection to the database
with teradatasql.connect(host='host123', user='sunil', password='sunil@123', logmech='LDAP') as conn:

    # Create a cursor object to execute SQL statements
    cur = conn.cursor()

    # Define the SQL query to retrieve all the patient records
    query = "SELECT * FROM patient"

    # Execute the SQL query
    cur.execute(query)

    # Iterate over the results using a for loop
    for row in cur:
        # Process each row as needed
        print(row)

OperationalError: [Version 17.20.0.19] [Session 0] [Teradata SQL Driver] Hostname lookup failed for host123
 at gosqldriver/teradatasql.formatError ErrorUtil.go:89
 at gosqldriver/teradatasql.(*teradataConnection).makeDriverError ErrorUtil.go:180
 at gosqldriver/teradatasql.(*nameLookup).getAddresses CopDiscovery.go:95
 at gosqldriver/teradatasql.discoverCops CopDiscovery.go:177
 at gosqldriver/teradatasql.newTeradataConnection TeradataConnection.go:156
 at gosqldriver/teradatasql.(*teradataDriver).Open TeradataDriver.go:32
 at database/sql.dsnConnector.Connect sql.go:759
 at database/sql.(*DB).conn sql.go:1393
 at database/sql.(*DB).Conn sql.go:1926
 at main.goCreateConnection goside.go:297
 at _cgoexp_361f854e4d93_goCreateConnection _cgo_gotypes.go:263
 at runtime.cgocallbackg1 cgocall.go:316
 at runtime.cgocallbackg cgocall.go:235
 at runtime.cgocallback asm_amd64.s:994
 at runtime.goexit asm_amd64.s:1594
Caused by lookup host123: no such host

In [38]:
!pip install teradatasql

Collecting teradatasql
  Downloading teradatasql-17.20.0.19-py3-none-any.whl (29.1 MB)
Collecting pycryptodome
  Downloading pycryptodome-3.17-cp35-abi3-win_amd64.whl (1.7 MB)
Installing collected packages: pycryptodome, teradatasql
Successfully installed pycryptodome-3.17 teradatasql-17.20.0.19